Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/TK_ЗапросЦенПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенПоставщикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапросовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураТекстом</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_ДанныеКоммерческихПредложенийОтПоставщика/TK_ДанныеКоммерческихПредложенийОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_ДанныеКоммерческихПредложенийОтПоставщика</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Пропущено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗапросЦенПоставщикам</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторСтрокиЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураТекстом</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВерсииЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/InformationRegisters/TK_ЗапросыЦенПоставщикамНаTeklifo/TK_ЗапросыЦенПоставщикамНаTeklifo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>TK_ЗапросыЦенПоставщикамНаTeklifo</name>
  <resources>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИдентификаторВерсии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЭтоАктуальнаяВерсия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.TK_ЗапросЦенПоставщикам</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/Forms/ФормаВыбораПозицийПоЗаказу/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Код процедур и функций



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы //<ИмяТаблицыФормы>

 &НаКлиенте
Процедура МатрицаДанныхПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ссылка") Тогда
		Ссылка = Параметры.Ссылка;
		ИнициализироватьМатрицуДанных();
	Иначе
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьМатрицуДанных()
	МатрицаДанных.Очистить();
	
	СтруктураДанных = ДанныеПредложенийПоЗапросу();
	
	
	ВыборкаПартнеры = СтруктураДанных.Партнеры.Выбрать();
	
	
	Пока ВыборкаПартнеры.Следующий() Цикл
		МассивДобавляемыхРеквизитов = Новый Массив;
		
		Группа = Элементы.Добавить("ГруппаПартнер_"+УникИдентификатор(ВыборкаПартнеры.Партнер),Тип("ГруппаФормы"),Элементы.МатрицаДанных);
        Группа.Вид = ВидГруппыФормы.ГруппаКолонок;
        Группа.Группировка = ГруппировкаКолонок.Вертикальная;
         		
        МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Выбран_"+УникИдентификатор(ВыборкаПартнеры.Партнер), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "МатрицаДанных", "")); 		
         		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("СуммаСНДС_"+УникИдентификатор(ВыборкаПартнеры.Партнер), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "МатрицаДанных", "Партнер"));
			
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Количество_"+УникИдентификатор(ВыборкаПартнеры.Партнер), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "МатрицаДанных", ""));	
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("Цена_"+УникИдентификатор(ВыборкаПартнеры.Партнер), Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 3)), "МатрицаДанных", ""));
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ДатаДоставки_"+УникИдентификатор(ВыборкаПартнеры.Партнер), Новый ОписаниеТипов("Дата", Новый КвалификаторыДаты(ЧастиДаты.Дата)), "МатрицаДанных", ""));	

 

		ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		ГруппаВыбранСумма = Элементы.Добавить("ГруппаВыбранСумма_"+УникИдентификатор(ВыборкаПартнеры.Партнер),Тип("ГруппаФормы"),Группа);
        ГруппаВыбранСумма.Вид = ВидГруппыФормы.ГруппаКолонок;
        ГруппаВыбранСумма.Группировка = ГруппировкаКолонок.Горизонтальная;
        
        
        ГруппаКоличествоЦена = Элементы.Добавить("ГруппаКоличествоЦена_"+УникИдентификатор(ВыборкаПартнеры.Партнер),Тип("ГруппаФормы"),Группа);
        ГруппаКоличествоЦена.Вид = ВидГруппыФормы.ГруппаКолонок;
        ГруппаКоличествоЦена.Группировка = ГруппировкаКолонок.Горизонтальная;
		
		
		
		НоваяКолонка = Элементы.Добавить("Выбран_" +УникИдентификатор(ВыборкаПартнеры.Партнер), Тип("ПолеФормы"),
			ГруппаВыбранСумма);
		НоваяКолонка.Заголовок = "";
		НоваяКолонка.ПутьКДанным = "МатрицаДанных." + "Выбран_" + УникИдентификатор(ВыборкаПартнеры.Партнер);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеФлажка;
		НоваяКолонка.ОтображатьВШапке = Ложь;
		
		
		НоваяКолонка = Элементы.Добавить("СуммаСНДС_" +УникИдентификатор(ВыборкаПартнеры.Партнер), Тип("ПолеФормы"),
			ГруппаВыбранСумма);
		НоваяКолонка.Заголовок = Строка(ВыборкаПартнеры.Партнер);
		НоваяКолонка.ПутьКДанным = "МатрицаДанных." + "СуммаСНДС_" + УникИдентификатор(ВыборкаПартнеры.Партнер);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
		
		
		НоваяКолонка = Элементы.Добавить("Количество_" +УникИдентификатор(ВыборкаПартнеры.Партнер), Тип("ПолеФормы"),
			ГруппаКоличествоЦена);
		НоваяКолонка.Заголовок = "Количество";
		НоваяКолонка.ПутьКДанным = "МатрицаДанных." + "Количество_" + УникИдентификатор(ВыборкаПартнеры.Партнер);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
		
		НоваяКолонка = Элементы.Добавить("Цена_" +УникИдентификатор(ВыборкаПартнеры.Партнер), Тип("ПолеФормы"),
			ГруппаКоличествоЦена);
		НоваяКолонка.Заголовок = "Цена";
		НоваяКолонка.ПутьКДанным = "МатрицаДанных." + "Цена_" + УникИдентификатор(ВыборкаПартнеры.Партнер);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
		
		НоваяКолонка = Элементы.Добавить("ДатаДоставки_" +УникИдентификатор(ВыборкаПартнеры.Партнер), Тип("ПолеФормы"),
			Группа);
		НоваяКолонка.Заголовок = "Дата доставки";
		НоваяКолонка.ПутьКДанным = "МатрицаДанных." + "ДатаДоставки_" + УникИдентификатор(ВыборкаПартнеры.Партнер);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеВвода;
		НоваяКолонка.ТолькоПросмотр = Истина;
	КонецЦикла;
	
	ВыборкаДанныхЗапроса = СтруктураДанных.ДанныеЗапроса.Выбрать();
	
	ВыборкаПредложений   = СтруктураДанных.ДанныеПредложений.Выбрать();
	
	Пока ВыборкаДанныхЗапроса.Следующий() Цикл
		СтрокаМатрицы = МатрицаДанных.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаМатрицы,ВыборкаДанныхЗапроса);
		
		НоменклатураНайдена = Ложь;
		Пока ВыборкаПредложений.НайтиСледующий(ВыборкаДанныхЗапроса.Номенклатура,"Номенклатура" ) Цикл
			GUIDПартнера = УникИдентификатор(ВыборкаПредложений.Партнер);
			СтрокаМатрицы["СуммаСНДС_" + GUIDПартнера] = ВыборкаПредложений.СуммаСНДСПредложено;
			СтрокаМатрицы["Количество_" + GUIDПартнера] = ВыборкаПредложений.КоличествоПредложено;
			СтрокаМатрицы["Цена_" + GUIDПартнера] = ВыборкаПредложений.ЦенаПредложено;
			СтрокаМатрицы["ДатаДоставки_" + GUIDПартнера] = ВыборкаПредложений.ДатаДоставкиПредложено;
			НоменклатураНайдена = Истина;
		КонецЦикла;
		
		Если Не НоменклатураНайдена Тогда
			Пока ВыборкаПредложений.НайтиСледующий(ВыборкаДанныхЗапроса.НоменклатураТекстом, "НоменклатураТекстом") Цикл
				GUIDПартнера = УникИдентификатор(ВыборкаПредложений.Партнер);
				СтрокаМатрицы["СуммаСНДС_" + GUIDПартнера] = ВыборкаПредложений.СуммаСНДСПредложено;
				СтрокаМатрицы["Количество_" + GUIDПартнера] = ВыборкаПредложений.КоличествоПредложено;
				СтрокаМатрицы["Цена_" + GUIDПартнера] = ВыборкаПредложений.ЦенаПредложено;
				СтрокаМатрицы["ДатаДоставки_" + GUIDПартнера] = ВыборкаПредложений.ДатаДоставкиПредложено;
				НоменклатураНайдена = Истина;
			КонецЦикла;
		КонецЕсли;
		
		ВыборкаПредложений.Сбросить();
	КонецЦикла; 
	
КонецПроцедуры



//вернем на место символы "-" (минус) в ГУИДе
Функция ВернутьПробелыGUID(ИД) Экспорт
    возврат  Сред(ИД,1,8)+"-"+Сред(ИД,9,4)+"-"+Сред(ИД,13,4)+"-"+Сред(ИД,17,4)+"-"+Сред(ИД,21,12);
КонецФункции // ВернутьПробелыGUID()


//Возвращает уникальный идентификатор объекта
//ссылкаНаОбъект - ссылка на объект для которого необходимо получить уникальный идентификатор
//возвращаемое значение - строка с уникальный идентификатором объекта без символов разделителей
Функция УникИдентификатор(ссылкаНаОбъект) Экспорт
	//попытка сделана чтобы не вылетали при ошибках в базе 1С, например когда 
	//в регистрах регистратор = неопределено NULL и тд...
	УникальныйКод = "";
	Попытка
		Если НЕ ссылкаНаОбъект.Пустая() Тогда 
			УникальныйКод = ссылкаНаОбъект.УникальныйИдентификатор();
		    УникальныйКод = СтрЗаменить(УникальныйКод,"-","");
		КонецЕсли;
	Исключение
	КонецПопытки;
	Возврат УникальныйКод;
КонецФункции // УникИдентификатор(ссылкаНаОбъект)()


&НаСервере
Функция ДанныеПредложенийПоЗапросу()
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Регистратор КАК КоммерческоеПредложение,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ИдентификаторВерсииЗапроса КАК ИдентификаторВерсииЗапроса,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ЗапросЦенПоставщикам КАК ЗапросЦенПоставщикам,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Партнер КАК Партнер,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Номенклатура КАК Номенклатура,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.НоменклатураТекстом КАК НоменклатураТекстом,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Количество КАК Количество,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.СуммаСНДС КАК СуммаСНДС,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ДатаДоставки КАК ДатаДоставки,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Цена
	|ПОМЕСТИТЬ ТЗДанныеКП
	|ИЗ
	|	РегистрСведений.TK_ДанныеКоммерческихПредложенийОтПоставщика.СрезПоследних(, ЗапросЦенПоставщикам = &Ссылка) КАК
	|		TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних
	|СГРУППИРОВАТЬ ПО
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Регистратор,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ИдентификаторВерсииЗапроса,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ЗапросЦенПоставщикам,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Партнер,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Номенклатура,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.НоменклатураТекстом,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Количество,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.СуммаСНДС,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.ДатаДоставки,
	|	TK_ДанныеКоммерческихПредложенийОтПоставщикаСрезПоследних.Цена
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КоммерческоеПредложение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	TK_ЗапросЦенПоставщикамТовары.Номенклатура КАК Номенклатура,
	|	TK_ЗапросЦенПоставщикамТовары.НоменклатураТекстом КАК НоменклатураТекстом,
	|	TK_ЗапросЦенПоставщикамТовары.Количество КАК Количество,
	|	TK_ЗапросЦенПоставщикамТовары.МаксимальнаяЦена КАК МаксимальнаяЦена,
	|	TK_ЗапросЦенПоставщикамТовары.ДатаДоставки КАК ДатаДоставки,
	|	TK_ЗапросЦенПоставщикамТовары.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ ДанныеЗапросаЦен
	|ИЗ
	|	Документ.TK_ЗапросЦенПоставщикам.Товары КАК TK_ЗапросЦенПоставщикамТовары
	|ГДЕ
	|	TK_ЗапросЦенПоставщикамТовары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеКП.КоммерческоеПредложение КАК КоммерческоеПредложение,
	|	ТЗДанныеКП.Партнер КАК Партнер,
	|	ДанныеЗапросаЦен.Номенклатура КАК Номенклатура,
	|	ДанныеЗапросаЦен.НоменклатураТекстом КАК НоменклатураТекстом,
	|	ДанныеЗапросаЦен.Количество КАК Количество,
	|	ДанныеЗапросаЦен.МаксимальнаяЦена КАК Цена,
	|	ДанныеЗапросаЦен.ДатаДоставки КАК ДатаДоставки,
	|	ТЗДанныеКП.Количество КАК КоличествоПредложено,
	|	ТЗДанныеКП.СуммаСНДС КАК СуммаСНДСПредложено,
	|	ТЗДанныеКП.ДатаДоставки КАК ДатаДоставкиПредложено,
	|	ТЗДанныеКП.Цена КАК ЦенаПредложено
	|ПОМЕСТИТЬ ОбщиеДанные
	|ИЗ
	|	ДанныеЗапросаЦен КАК ДанныеЗапросаЦен
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТЗДанныеКП КАК ТЗДанныеКП
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.TK_ЗапросыЦенПоставщикамНаTeklifo.СрезПоследних(, Документ = &Ссылка) КАК
	|				TK_ЗапросыЦенПоставщикамНаTeklifoСрезПоследних
	|			ПО ТЗДанныеКП.ЗапросЦенПоставщикам = TK_ЗапросыЦенПоставщикамНаTeklifoСрезПоследних.Документ
	|		ПО ДанныеЗапросаЦен.Номенклатура = ТЗДанныеКП.Номенклатура
	|		ИЛИ ДанныеЗапросаЦен.НоменклатураТекстом = ТЗДанныеКП.НоменклатураТекстом
	|ГДЕ
	|	ТЗДанныеКП.ИдентификаторВерсииЗапроса = TK_ЗапросыЦенПоставщикамНаTeklifoСрезПоследних.ИдентификаторВерсии
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанные.Номенклатура КАК Номенклатура,
	|	ОбщиеДанные.НоменклатураТекстом КАК НоменклатураТекстом,
	|	СУММА(ОбщиеДанные.Количество) КАК Количество,
	|	ОбщиеДанные.Цена КАК Цена,
	|	ОбщиеДанные.ДатаДоставки КАК ДатаДоставки
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеДанные.Номенклатура,
	|	ОбщиеДанные.НоменклатураТекстом,
	|	ОбщиеДанные.Цена,
	|	ОбщиеДанные.ДатаДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанные.Партнер КАК Партнер
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные
	|СГРУППИРОВАТЬ ПО
	|	ОбщиеДанные.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбщиеДанные.Партнер,
	|	ОбщиеДанные.КоличествоПредложено,
	|	ОбщиеДанные.СуммаСНДСПредложено,
	|	ОбщиеДанные.ДатаДоставкиПредложено,
	|	ОбщиеДанные.Номенклатура,
	|	ОбщиеДанные.НоменклатураТекстом,
	|	ОбщиеДанные.ЦенаПредложено
	|ИЗ
	|	ОбщиеДанные КАК ОбщиеДанные");
	Запрос.УстановитьПараметр("Ссылка",Ссылка );
	
	Результат = Запрос.ВыполнитьПакет();
	
	Возврат  Новый Структура("ДанныеЗапроса,Партнеры,ДанныеПредложений", Результат.Получить(3),Результат.Получить(4),Результат.Получить(5));
	
КонецФункции


#КонецОбласти
